import React from "react";
import Accordion from "./Accordion";

type Props = {};

export default function Qa({}: Props) {
  return (
    <div className="flex flex-col px-5 py-4 md:px-[4.5rem] md:mt-[4.75rem] md:pt-0">
      <h2 className="font-Digibank-Medium text-2xl md:font-Digibank-Regular md:text-[2.5rem] md:mb-[2.75rem]">
        שאלות תשובות
      </h2>
      <Accordion
        details={
          <p className="md:hidden">
            החשבון שלך איתך בכל מקום, באפליקציה של ONE ZERO. בעת התחברות לחשבון,
            ניתן לבחור בהזדהות ע״י זיהוי פנים (האפשרות הנוחה ביותר) או באמצעות
            סיסמה.
          </p>
        }
        summary={"איך נכנסים לחשבון?"}
      />
      <Accordion
        details={
          <p className="md:hidden">
            פרטי החשבון המלאים שלך, כולל מספר IBAN ו-Swift Code (הנדרשים להעברות
            בנקאיות לחו״ל) מופיעים בכפתור הפרופיל האישי״ - בצורת דמות, בחלק
            העליון משמלא במסך הראשי באפליקציה. בכפתור זה ניתן לצפות בתיבת
            המסמכים וההודעות, לבצע שינויים במסגרות החשבון וכרטיס החיוב, וגם
            להעביר את פעילות החשבון בבנק הקודם בלחיצת כפתור (ובליווי צוות קבלת
            הפנים).
          </p>
        }
        summary={"מהם פרטי החשבון החדש שלי?"}
      />
      <Accordion
        details={
          <p className="md:hidden">
            ׳אלה׳ היא מערכת הבינה המלאכותית שיצרנו - הבנקאית הפרטית הדיגיטלית
            שלך, שתלווה אותך בצ׳אט ותסייע לך בכל תחום הקשור לניהול חשבונך. ׳אלה׳
            תשלח לך חדשות ועדכונים, תבצע עבורך פעולות לבקשתך, תקשר אותך עם צוות
            הבנקאים ומנהלי הכספים במידת הצורך ותבצע מעקב אחר הטיפול בפניותיך.
          </p>
        }
        summary={"מי זו ׳אלה׳ הבנקאית הפרטית הדיגיטלית?"}
      />
      <Accordion
        details={
          <p className="md:hidden">
            בעמוד הפרופיל האישי (כפתור בצורת דמות בעמוד הראשי באפליקציה), ניתן
            לבחור ב״שינוי מסגרות החשבון״ - ולבקש הגדלה או הקטנה של מסגרת כרטיס
            האשראי או של העו״ש.
          </p>
        }
        summary={"איך משנים את המסגרת בכרטיס ובחשבון?"}
      />
      <Accordion
        details={
          <p className="md:hidden">
            בקלות, דרך כפתור ״העברה״ במסך הראשי באפליקציה (מצד שמאל למטה) - שם
            ניתן לבחור בין העברה בנקאית רגילה או העברה מיידית (העברת זה״ב).
          </p>
        }
        summary={"איך מבצעים העברה בנקאית?"}
      />
      <Accordion
        details={
          <p className="md:hidden">
            תוכניות החיסכון שלנו זמינות לך בעמוד ״צמיחה״ במדרך הראשי באפליקציה
            (מצד ימין למטה) - שם ניתן לבחור בין תוכנית עם תחנת יציאה יומית,
            חודשית או שנתית, כאשר הריביות העדכניות של כל חיסכון מופיעות באתר
            שלנו. חשוב לשים לב שבתוכנית החיסכון החודשית נדרש לבחור סכום הפקדה
            ראשוני וגם הפקדה חודשית. אם ברצונך לבטל את האפשרות להפקדה חודשית,
            ניתן לבחור ב״הקפאת הפקדות״ בעמוד התוכנית לאחר פתיחתה. אגב, בעמוד
            ״צמיחה״ ניתן גם לגשת למערכת המסחר בניירות ערך ולהגיש בקשה להלוואה.
          </p>
        }
        summary={"איך פותחים תוכנית חיסכון (פיקדון)?"}
      />
      <Accordion details={<p className="md:hidden">
      ניתן לבצע המרת מט״ח (מכירה וקניה) - בעמוד ״החשבון שלי״ במסך הראשי באפליקציה (מצד שמאל למטה) &#62; בלשונית ״מט״ח״.
      </p>} summary={"איך רוכשים מט״ח?"} />
      <Accordion details={<p className="md:hidden">
      ניתן לבצע העברת מט״ח ע״י צוות הבנקאים בצ׳אט - דרך כפתור צ׳אט במסך הראשי באפליקציה (מצד ימין למטה) &#62; בכפתור ״העברות״ &#62; ״העברת מט״ח״ &#62; אלה תבקש ממך את כל הפרטים הרלוונטיים לצורך ההעברה - לכן חשוב להשלים את התהליך במלואו! ההעברה תתבצע תוך מספר ימי עסקים.

      </p>} summary={"איך מעבירים מט״ח?"} />
      <Accordion details={<p className="md:hidden">
      ניתן לבצע מגוון פעולות הקשורות לצ׳קים, בהן: הפקדות, הזמנת פנקס, צ׳ק בנקאי וקבלת מידע נוסף - בעמוד ״החשבון שלי״ במסך הראשי באפליקציה (מצד שמאל למטה) &#62; בלשונית ״צ׳קים״.
      </p>} summary={"איך מפקידים צ׳ק?"} />
      <Accordion details={<p className="md:hidden">
      ניתן לצפות בפעילות העו״ש העדכנית שלך, ביתרת החשבון ובמסגרתו - בעמוד ״החשבון שלי״ במסך הראשי באפליקציה (מצד שמאל למטה) &#62; בלשונית ״עו״ש״.
      </p>} summary={"איך צופים בתנועות בחשבון?"} />
      <Accordion details={<p className="md:hidden">
      ניתן לבצע מגוון פעולות הקשורות לכרטיסי החיוב, בהן: צפייה בחיובים הקרובים והקודמים, צפייה בקוד הסודי, הקפאה וביטול של הכרטיס, צפייה במסגרת ובירור עסקאות - בעמוד ״החשבון שלי״ במסך הראשי באפליקציה (מצד שמאל למטה) &#62; בלשונית ״כרטיסים״.
      </p>} summary={"איך צופים בפירוט החיובים בכרטיס?"} />
      <Accordion details={<p className="md:hidden">
      ניתן לצפות בקוד הסודי האישי של כרטיס החיוב שלך, המפנה לאתר חברת האשראי (ישראכרט) - בעמוד ״החשבון שלי״ במסך הראשי באפליקציה (מצד שמאל למטה)  &#62; בלשונית ״כרטיסים״.
      </p>} summary={"איך ניתן לצפות בקוד הסודי של הכרטיס?"} />
    </div>
  );
}
